***CONFIGURAMOS EL SWITCH S2 CON VTP MODE CLIENT***
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname s2
s2(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
s2(config)#vtp domain tomas-01
Changing VTP domain name from NULL to tomas-01
s2(config)#
*Sep 20 15:15:49.567: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to tomas-01.
s2(config)#vtp password tomas
Setting device VTP password to tomas
s2(config)#end


***CONFIGURAMOS EL SWITCH S1 CON VTP MODE SERVER***
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname s1
s1(config)#vtp mode server
Device mode already VTP Server for VLANS.
s1(config)#vtp domain tomas-01
Changing VTP domain name from NULL to tomas-01
s1(config)#
*Sep 20 15:18:36.357: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to tomas-01.
s1(config)#vtp password tomas
Setting device VTP password to tomas
s1(config)#ex


***TRUNCAMOS LAS INTERFACES G0/0-3 DEL SWITCH S2***
s2#ena
s2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s2(config)#inter range g0/0-3
s2(config-if-range)#switchport trunk encapsulation dot1q
s2(config-if-range)#switchport mode trunk
s2(config-if-range)#switchport trunk native vlan 99
s2(config-if-range)#exit

***TRUNCAMOS EN EL MISMO SWITCH LA INTERFAZ G1/0***
s2#ena
s2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s2(config)#inter g1/0
s2(config-if)#switchport trunk encapsulation dot1q
s2(config-if)#switchport mode trunk
s2(config-if)#switchport trunk native vlan 99
s2(config-if)#end


***TRUNCAMOS LAS INTERFACES 0/0-3 DEL SWITCH S1*** 
s1>ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#inter range g0/0-3
s1(config-if-range)#switchport trunk encapsulation dot1q
s1(config-if-range)#switchport mode trunk
s1(config-if-range)#switchport trunk native vlan 99
s1(config-if-range)#end

***TRUNCAMOS EN EL MISMO SWITCH LA INTERFAZ G1/0***

s1#ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#inter g1/0
s1(config-if)#switchport trunk encapsulation dot1q
s1(config-if)#switchport mode trunk
s1(config-if)#switchport trunk native vlan 99
s1(config-if)#
*Sep 20 15:36:00.462: %CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on GigabitEthernet1/0 (1), with s2 GigabitEthernet1/0 (99).
s1(config-if)#end


  
***CREAMSOS LAS VLAS EN EL SWITCH  S1 QUE ES EL VTP SERVER***
s1#ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#vlan 10
s1(config-vlan)#name tomas
s1(config-vlan)#exit
s1(config)#vlan 20
s1(config-vlan)#name rubi
s1(config-vlan)#exit
s1(config)#end


***CREAMOS LAS SUB-INTERFACEZ EN EL ROUTER R1***
R1(config)#inter fa1/0
R1(config-if)#no ip add
R1(config-if)#no sh
R1(config-if)#exit
R1(config)#i
*Mar  1 00:49:39.724: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to up
*Mar  1 00:49:40.726: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up
R1(config)#inter fa1/0
R1(config-if)#inter fa1/0.10
R1(config-subif)#encapsulation dot1q 10
R1(config-subif)#ip address 192.168.10.1 255.255.255.0
R1(config-subif)#exit
R1(config)#
R1(config)#inter fa1/0
R1(config-if)#inter fa1/0.20
R1(config-subif)#encapsulation dot1q 20
R1(config-subif)#ip address 192.168.20.1 255.255.255.0
R1(config-subif)#exit
R1(config)#end


  
***LE DAMOS ACCESO A LAS INTERFACEZ A SU RESPECTIVA VLAN EN EL SWITCH S2*** 
s2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s2(config)#inter range g0/0-1
s2(config-if-range)#switchport mode access
s2(config-if-range)#switchport access vlan 10
s2(config-if-range)#exit
s2(config)#inter range g0/2-3
s2(config-if-range)#switchport mode access
s2(config-if-range)#switchport access vlan 20
s2(config-if-range)#exit
s2(config)#end
s2#


***LE DAMOS ACCESO A LAS INTERFACEZ A SU RESPECTIVA VLAN EN EL SWITCH S1***
s1>ena
s1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
s1(config)#inter range g0/0-1
s1(config-if-range)#switchport mode access
s1(config-if-range)#switchport access vlan 10
s1(config-if-range)#exit
s1(config)#inter range g0/2-3
s1(config-if-range)#switchport mode access
s1(config-if-range)#switchport access vlan 20
s1(config-if-range)#exit
s1(config)#end


  
***CONFIGURACIÃ“N DEL DHCP***
R1#ena
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip dhcp pool vlan10
R1(dhcp-config)#network 192.168.10.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.10.1
R1(dhcp-config)#dns-server 192.168.10.1
R1(dhcp-config)#exit
R1(config)#ip dhcp pool vlan20
R1(dhcp-config)#network 192.168.20.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.20.1
R1(dhcp-config)#dns-server 192.168.20.1
R1(dhcp-config)#exit
R1(config)#end






  
  
